<template>
  <el-card header="多行文字溢出">
    <div class="container">
      <h2>单行标题单行标题单行标题单行标题单行标题单行标题单行标题</h2>
      <p>两行标题两行标题两行标题两行标题两行标题两行标题两行标题两行标题两行标题两行标题两行标题两行标题两行标题两行标题</p>
      <p>超过两行的标题超过两行的标题超过两行的标题超过两行的标题超过两行的标题超过两行的标题超过两行的标题超过两行的标题超过两行的标题超过两行的标题超过两行的标题超过两行的标题超过两行的标题超过两行的标题超过两行的标题超过两行的标题超过两行的标题超过两行的标题超过两行的标题超过两行的标题超过两行的标题超过两行的标题超过两行的标题超过两行的标题超过两行的标题超过两行的标题超过两行的标题超过两行的标题超过两行的标题超过两行的标题超过两行的标题超过两行的标题超过两行的标题超过两行的标题超过两行的标题超过两行的标题超过两行的标题超过两行的标题超过两行的标题超过两行的标题超过两行的标题超过两行的标题超过两行的标题超过两行的标题超过两行的标题超过两行的标题超过两行的标题超过两行的标题超过两行的标题超过两行的标题超过两行的标题超过两行的标题超过两行的标题超过两行的标题超过两行的标题超过两行的标题超过两行的标题超过两行的标题超过两行的标题超过两行的标题超过两行的标题超过两行的标题超过两行的标题超过两行的标题超过两行的标题超过两行的标题超过两行的标题超过两行的标题超过两行的标题超过两行的标题超过两行的标题超过两行的标题超过两行的标题超过两行的标题超过两行的标题超过两行的标题超过两行的标题超过两行的标题超过两行的标题超过两行的标题超过两行的标题超过两行的标题超过两行的标题超过两行的标题超过两行的标题超过两行的标题超过两行的标题超过两行的标题超过两行的标题超过两行的标题超过两行的标题超过两行的标题超过两行的标题超过两行的标题超过两行的标题超过两行的标题超过两行的标题超过两行的标题超过两行的标题超过两行的标题</p>
    </div>
  </el-card>
</template>
<script setup name="text-overflow" lang="ts">

</script>
<style lang="scss" scoped>
  .container {
    width: 300px;
    margin: 20px auto;
  }

  h2 {
    overflow: hidden;
    text-overflow: ellipsis;
    text-align: center;
    white-space: nowrap;
  }

  p {
    display: inline-block;
    text-align: left;
    overflow: hidden;
    text-overflow: ellipsis;
    display: -webkit-box;
    -webkit-line-clamp: 2;
    -webkit-box-orient: vertical;
  }
</style>